Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Catalogs/Охотники/Forms/ФормаЭлемента/Module.bsl
#Область ОсновныеДанные
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	Объект.Фамилия = Трег(СокрЛП(Объект.Фамилия));
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеИзменениеЗавершение(ДополнительныеПараметры) Экспорт
	Модифицированность = Ложь;
КонецПроцедуры	

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Имя = Трег(СокрЛП(Объект.Имя));
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	Объект.Отчество = Трег(СокрЛП(Объект.Отчество));
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	Если Год(ТекущаяДата()) - Год(Объект.ДатаРождения) > 85 Тогда
		Элементы.ВетеранВОВ.Видимость = Истина;
	Иначе	
		Элементы.ВетеранВОВ.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНаименование()
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + ?(ПустаяСтрока(Объект.Отчество),""," " + Объект.Отчество);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаДубли(Ссылка,Фамилия,Имя,Отчество,ДатаРождения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Охотники.Ссылка
	|ИЗ
	|	Справочник.Охотники КАК Охотники
	|ГДЕ
	|	Охотники.Фамилия = &Фамилия
	|	И Охотники.Имя = &Имя
	|	И Охотники.Отчество = &Отчество
	|	И Охотники.ДатаРождения = &ДатаРождения
	|	И %УсловиеСсылки%";
	
	Если Ссылка.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И %УсловиеСсылки%","");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И %УсловиеСсылки%","И Охотники.Ссылка <> &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
	КонецЕсли;	
		
	
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("Отчество", Отчество);
	Запрос.УстановитьПараметр("Фамилия", Фамилия);
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = Результат.Выбрать();		
		
		Если Выборка.Следующий() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
#КонецОбласти


#Область ТабличныеЧасти
&НаКлиенте
Процедура ГосБилетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ГосБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидБилета",ГосБилет);
	ПараметрыОткрытия.Вставить("Добавление",Истина);
	
	
	
	Если  Объект.Ссылка.Пустая() Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Перед созданием билетов необходимо записать охотника в базу.
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Перед созданием билетов необходимо записать охотника в базу.
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ДанныеОхотника.Лишен Тогда
		Текст = "Охотник лишен права охоты.
		|Гос билет зарегистрировать невозможно";
		ПоказатьСообщениеНаСервере(Текст,"Объект");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ДанныеОхотника.ЕстьГосБилет Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У охотника уже есть действующий гос билет");
	Иначе	
		Если НЕ Копирование Тогда
			Отказ = Истина;
			ОткрытьФормуБилета(ПараметрыОткрытия);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ГосБилетыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ГосБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидБилета",ГосБилет);
	ПараметрыОткрытия.Вставить("Ключ",Элемент.ТекущаяСтрока);
	
	Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Данные охотника изменены. Необходимо записать охотника в базу.
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуБилета(ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ЧленскиеБилетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	
	Если НЕ ДанныеОхотника.ЕстьГосБилет Тогда
		Текст = "Охотник не имеет гос билета.
		|Членский билет зарегистрировать невозможно";
		ПоказатьСообщениеНаСервере(Текст,"Объект");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	
	ЧленскийБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидБилета",ЧленскийБилет);
	ПараметрыОткрытия.Вставить("Добавление",Истина);
		
	
	Если  Объект.Ссылка.Пустая() Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Перед созданием билетов необходимо записать охотника в базу.
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Объект был изменен. Необходимо записать охотника
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
		 
	Если ДанныеОхотника.ЕстьЧленскийБилет Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У охотника уже есть действующий членский билет");
	Иначе	
		Если НЕ Копирование Тогда
			Отказ = Истина;
			ОткрытьФормуБилета(ПараметрыОткрытия);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЧленскиеБилетыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ЧленскийБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидБилета",ЧленскийБилет);
	ПараметрыОткрытия.Вставить("Ключ",Элемент.ТекущаяСтрока);
		Если Модифицированность Тогда
		Описание = Новый ОписаниеОповещения("БилетыНачалоДобавления",ЭтаФорма,ПараметрыОткрытия);
		ПоказатьВопрос(Описание,"Данные охотника изменены. Необходимо записать охотника в базу.
		|Записать охотника?",РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуБилета(ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура БилетыНачалоДобавления(РезультатВопроса,ПараметрыОткрытия) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если ЭтаФорма.Записать() Тогда
		ОткрытьФормуБилета(ПараметрыОткрытия);	
	Иначе
		Текст = "Не удалось записать объект";
		Поле = "Объект";
		ПоказатьСообщениеНаСервере(Текст,Поле);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуБилета(ПараметрыОткрытия)
	
	Если ПараметрыОткрытия.ВидБилета = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет") Тогда 
		ГосБилет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет");
		ПараметрыБилета = Новый Структура("Охотник,ВидБилета,Охотхозяйство",Объект.Ссылка,ГосБилет);
		Если НЕ ДанныеОхотника.ЕстьГосБилет Тогда
			
			Текст = "Нет действительного государственного билета.
			|Создание членского билета невозможно.";
			Поле = "ГосБилеты";
			ПоказатьСообщениеНаСервере(Текст,Поле);
			Объект.ЧленОООР = Ложь;
			Объект.Охотхозяйство = ПредопределенноеЗначение("Справочник.Охотники.ПустаяСсылка");
			ЭтаФорма.Записать();
			Возврат;
	
		КонецЕсли;
	КонецЕсли;
	
		
	
	Если ПараметрыОткрытия.Свойство("Ключ") И  ЗначениеЗаполнено(ПараметрыОткрытия.Ключ) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПараметрыОткрытия.Ключ);
	Иначе	
		ЗначенияЗаполнения = Новый Структура("Охотник,ВидБилета",Объект.Ссылка,ПараметрыОткрытия.ВидБилета);
		
		Если ПараметрыОткрытия.Свойство("Добавление") Тогда
			ЗначенияЗаполнения.Вставить("Действует",ПараметрыОткрытия.Добавление);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;	
	
	Если ПараметрыФормы.Количество() > 0 Тогда
		ОткрытьФорму("РегистрСведений.ОхотничьиБилеты.ФормаЗаписи", ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	КонецЕсли;	
	
КонецПроцедуры	
#КонецОбласти


&НаСервереБезКонтекста
Процедура ПоказатьСообщениеНаСервере(Текст,Поле)
	ОхотаСервер.ПоказатьСообщение(Текст,Поле);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ДанныеОхотника = Неопределено Тогда
		ДанныеОхотника = ОхотаСерверПовтИсп.ПолучитьДанныеОхотника(Объект.Ссылка);
	КонецЕсли;	
	

	Если ДанныеОхотника.ЕстьЧленскийБилет <> Объект.ЧленОООР Тогда
		Объект.ЧленОООР = ДанныеОхотника.ЕстьЧленскийБилет;
	КонецЕсли;	
	
	Если НЕ ДанныеОхотника.ЕстьЧленскийБилет Тогда
		Объект.ЧленОООР  = Ложь;
		Элементы.ЧленОООР.Заголовок = "Не является членом ОООР";
		Элементы.ЧленККОООР.Заголовок = "Не является членом ККОООР";
		Объект.Охотхозяйство = Неопределено; 
		
	ИначеЕсли   Объект.Охотхозяйство.ЧленствоККОООР = Истина Тогда
		Объект.ЧленККОООР  = Истина;
		Объект.ЧленОООР  = Истина;
		Элементы.ЧленККОООР.Заголовок = "Член ККОООР";
		
	Иначе
		Объект.ЧленОООР  = Истина;
		Элементы.ЧленОООР.Заголовок = "Член ОООР";
		Элементы.ЧленККОООР.Заголовок = "Не является членом ККОООР";

		Объект.Охотхозяйство = ДанныеОхотника.КемВыданЧленскийБилет;
		Элементы.ЧленОООР.Заголовок = "Является членом " + ПолучитьРеквизитСсылки(ДанныеОхотника.КемВыданЧленскийБилет,"Наименование");
	КонецЕсли;
	
	УстановитьПараметрыДинамическихСписков();
	ПолучитьРеквизитыАдреса();
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметрыДинамическихСписков()
	ГосБилеты.Параметры.УстановитьЗначениеПараметра("Охотник",Объект.Ссылка);
	ЧленскиеБилеты.Параметры.УстановитьЗначениеПараметра("Охотник",Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыАдреса(ЗаписатьНабор = Ложь)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		Набор.Отбор.Охотник.Установить(Объект.Ссылка);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			Если ЗаписатьНабор Тогда
				Запись = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(Запись,ЭтотОбъект);
				Запись.Охотник = Объект.Ссылка;
				
				Набор.Записать(Истина);
			Иначе	
			     Возврат;
			КонецЕсли;	 
		Иначе
			Запись = Набор.Получить(0);
			
			Если ЗаписатьНабор Тогда
				
				ЗаполнитьЗначенияСвойств(Запись,ЭтотОбъект);
				Запись.Охотник = Объект.Ссылка;
				
				Набор.Записать(Истина);
			Иначе
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,Запись);	
			КонецЕсли;	 
			
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, ПараметрыОтвета, Источник)
	Если ИмяСобытия = "ИзменениеОхотничьегоБилета" Тогда
		
		Если ПараметрыОтвета.Билет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет") Тогда
			Если НЕ ПараметрыОтвета.Действует Тогда
				Объект.ЧленОООР  = Ложь;
				Объект.ЧленККОООР  = Ложь;
				Элементы.ЧленОООР.Заголовок = "Не является членом ОООР";
				Элементы.ЧленККОООР.Заголовок = "Не является членом ККОООР";
				Объект.Охотхозяйство = Неопределено; 
			Иначе
				Объект.ЧленОООР  = Истина;
				Элементы.ЧленОООР.Заголовок = "Член ОООР";
				Объект.Охотхозяйство = ПараметрыОтвета.ЗарегистрированВ;
				Элементы.ЧленОООР.Заголовок = "Является членом " + ПолучитьРеквизитСсылки(ПараметрыОтвета.ЗарегистрированВ,"Наименование");
				Объект.ЧленККОООР  = Истина;
				Элементы.ЧленККОООР.Заголовок = "Является членом ККОООР";
			КонецЕсли;
			Если ПараметрыОтвета.Исключен Тогда
				Объект.Исключен=Истина;
			КонецЕсли;
		ИначеЕсли ПараметрыОтвета.Билет = ПредопределенноеЗначение("Перечисление.ВидыОхотничьихБилетов.ГосБилет") Тогда
			Объект.СерияГосБилета = ?(ПараметрыОтвета.Действует,ПараметрыОтвета.Серия,"");
			Объект.НомерГосБилета = ?(ПараметрыОтвета.Действует,ПараметрыОтвета.Номер,"");
		КонецЕсли;
		
		Попытка
			ЭтаФорма.Записать();
			
			ДанныеОхотника = ОхотаСерверПовтИсп.ПолучитьДанныеОхотника(Объект.Ссылка);
			
			Если ГосБилеты.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Охотник")).Значение.Пустая() Тогда
				УстановитьПараметрыДинамическихСписков();
			КонецЕсли;
				
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Возникли ошибки записи охотника");
		КонецПопытки;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Объект.Ссылка); //"ИзменениеДанныхОхотника"
	ПолучитьРеквизитыАдреса(Истина);
	КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПроверитьНаДубли(Объект.Ссылка,Объект.Фамилия,Объект.Имя,Объект.Отчество,Объект.ДатаРождения) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НаименованиеИзменениеЗавершение",ЭтаФорма);
		ТекстПредупреждения = "Такой пользователь существует.
		|Дублировать записи запрещено.";
		ПоказатьПредупреждение(ОписаниеОповещения,ТекстПредупреждения,5,"Проверка дублей охотников");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	ПолучитьНаименование();
	 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(Ссылка,Реквизит)
	Возврат Ссылка[Реквизит];
КонецФункции	

&НаКлиенте
Процедура Печать(Команда)
	ИмяМакета = Команда.Имя;
		
	ОткрытьФормуПечатиСправочники(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПечатиСправочники(ИмяМакета)
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ИмяМакета",ИмяМакета);
	ПараметрыПечати.Вставить("Справочник",Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ФормаПечатиСправочники",ПараметрыПечати,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры
